In [3]:
import pandas as pd
a={"Name":["akii","sidhu","jaya","saami","Ravi","subu","arun","gowri","dinesh"],
    "Age":[10,20,30,34,56,64,32,43,32]}
type(a)

dict

In [4]:
df=pd.DataFrame(a)

In [5]:
type(df)

pandas.core.frame.DataFrame

In [6]:
df.head()

    Name  Age
0   akii   10
1  sidhu   20
2   jaya   30
3  saami   34
4   Ravi   56

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    9 non-null      object
 1   Age     9 non-null      int64
dtypes: int64(1), object(1)
memory usage: 276.0+ bytes

In [8]:
df.describe()

             Age
count   9.000000
mean   35.666667
std    16.718253
min    10.000000
25%    30.000000
50%    32.000000
75%    43.000000
max    64.000000

In [12]:
data=pd.read_csv("D:/mylevel/Level1/fill.csv")

In [13]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    9 non-null      object
 1   age     9 non-null      int64
 2   place   9 non-null      object
dtypes: int64(1), object(2)
memory usage: 348.0+ bytes

In [14]:
data.head()

      name  age place
0      aki   34   tri
1  dharani   22   tri
2   sabari   21   ari
3      sid   22   nil
4     arun   43   tki

In [16]:
data.describe()

             age
count   9.000000
mean   33.888889
std    11.783934
min    21.000000
25%    22.000000
50%    32.000000
75%    43.000000
max    56.000000